<div class="alert alert-block alert-info">
    
<h1 style="color:Blue;"> <center> <ins> <b> 
ESTATÍSTICA APLICADA 
</b> </ins> </center> </h1>
    
<h3 style="color:Blue;"> <center> <b> 
Exercícios 3b
</b></center> </h3>
    
</div>

Nessa atividade, iremos explorar o conjunto de dados `titanic.csv`, que contém informações sobre os passageiros do navio Titanic, que nafraugou no início do século passado. Esse é um conjunto de dados bem famoso, bastante comum em treinamentos e práticas relacionadas a análise de dados e aprendizagem de máquinas.

O conjunto de dados pode ser encontrado nesse [link](https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv).

Para que se possa trabalhar de forma mais consciente, eis um dicionário dos dados coletados nesse conjunto:

* __PassengerId__: Número de identificação do passageiro
* __Survived__: Informa se o passageiro sobreviveu ao desastre
    * 0 = Não
    * 1 = Sim
* __Pclass__: Classe do bilhete
    * 1 = 1ª Classe
    * 2 = 2ª Classe
    * 3 = 3ª Classe
* __Name__: Nome do passageiro
* __Sex__: Sexo do passageiro
* __Age__: Idade do passageiro
* __SibSp__: Quantidade de cônjuges e irmãos a bordo
* __Parch__: Quantidade de pais e filhos a bordo
* __Ticket__: Número da passagem
* __Fare__: Preço da Passagem
* __Cabin__: Número da cabine do passageiro
* __Embarked__: Porto no qual o passageiro embarcou
    * C = Cherbourg
    * Q = Queenstown
    * S = Southampton

Considerando esse conjunto de dados, realize as seguintes atividades:

<div class="alert alert-block alert-info" style="color:Blue;">
1. Carregue o conjunto de dados em um dataframe
</div>

In [2]:
import pandas as pd
import numpy as nd

titaniC = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv')
titaniC.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<div class="alert alert-block alert-info" style="color:Blue;">
2. Quantas linhas e quantas colunas tem o conjunto de dados?
</div>

In [3]:
titaniC.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

<div class="alert alert-block alert-info" style="color:Blue;">
3. Liste todas as colunas do conjunto de dados.
</div>

In [4]:
titaniC.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

<div class="alert alert-block alert-info" style="color:Blue;">
4. Delete as colunas PassengerID e Ticket do conjunto de dados.
</div>

In [5]:
titaniC.drop(['PassengerId'], axis=1, inplace=True)
titaniC.drop(['Ticket'], axis=1, inplace=True)

In [6]:
titaniC.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Fare      891 non-null    float64
 8   Cabin     204 non-null    object
 9   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 69.7+ KB

<div class="alert alert-block alert-info" style="color:Blue;">
5. Selecione as colunas Pclass, Age e Sex, e forme um novo dataframe com essa seleção.
</div>

In [7]:
titan = titaniC.loc[:,['Pclass','Age','Sex']]
titan

     Pclass   Age     Sex
0         3  22.0    male
1         1  38.0  female
2         3  26.0  female
3         1  35.0  female
4         3  35.0    male
..      ...   ...     ...
886       2  27.0    male
887       1  19.0  female
888       3   NaN  female
889       1  26.0    male
890       3  32.0    male

[891 rows x 3 columns]

<div class="alert alert-block alert-info" style="color:Blue;">
6. Exclua, do novo dataframe, todas as linhas que possuam algum valor faltoso.  
</div>

In [8]:
titan.dropna(how='any')

     Pclass   Age     Sex
0         3  22.0    male
1         1  38.0  female
2         3  26.0  female
3         1  35.0  female
4         3  35.0    male
..      ...   ...     ...
885       3  39.0  female
886       2  27.0    male
887       1  19.0  female
889       1  26.0    male
890       3  32.0    male

[714 rows x 3 columns]

<div class="alert alert-block alert-info" style="color:Blue;">
7. Faça uma filtragem que considere somente passageiros com idade igual ou superior a 35 anos.
</div>

In [9]:
titan_mask=titan['Age']>= 35
filtered_titan = titan[titan_mask]
print(filtered_titan)

     Pclass   Age     Sex
1         1  38.0  female
3         1  35.0  female
4         3  35.0    male
6         1  54.0    male
11        1  58.0  female
..      ...   ...     ...
865       2  42.0  female
871       1  47.0  female
873       3  47.0    male
879       1  56.0  female
885       3  39.0  female

[235 rows x 3 columns]

<div class="alert alert-block alert-info" style="color:Blue;">
8. Quantos passageiros da terceira classe ao menos 20 anos?
</div>

In [12]:
titan = titaniC = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv',usecols=['Pclass','Age','Sex'])
titan[(titan['Pclass'] <= 2 )&(titan['Age'] >= 20)].count()

Pclass    303
Sex       303
Age       303
dtype: int64

<div class="alert alert-block alert-info" style="color:Blue;">
9. Quantos passegeiros possuem idade igual ou superior a 50 anos, viajaram na primeira ou na segunda classe e eram do sexo masculino?
</div>

In [11]:
titan= titaniC = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv',usecols=['Pclass','Age','Sex'])
titan[(titan['Pclass'] <= 2 )&(titan['Age'] >= 50)&(titan['Sex'] == 'male')].count()

Pclass    42
Sex       42
Age       42
dtype: int64